{
	"FormatVersion": 2,
	"Namespace": "",
	"Children": [
		{
			"Source":
			{
				"Text": "<h1>RichLinks</>\r\n\r\nRichLinks is a lightweight Unreal Engine plugin that enables mouse-events (enter/leave) for <link id=\"inline\">inline links</> inside <link id=\"richtext\">RichTextBlock</> widgets. It's designed for UI developers who want to trigger events or show tooltips when users hover over specific words or tags in rich text.\r\n\r\nTo receive mouse events from link texts (e.g. hover callbacks), your RichTextBlock must use the <link id=\"decorator\">ULinkRichTextDecorator</> and the UUserWidget must implement the <link id=\"interface\">ILinkEventReceiver</> interface."
			},
			"Translation":
			{
				"Text": "<h1>RichLinks</>\r\n\r\nRichLinks is a lightweight Unreal Engine plugin that enables mouse-events (enter/leave) for <link id=\"inline\">inline links</> inside <link id=\"richtext\">RichTextBlock</> widgets. It's designed for UI developers who want to trigger events or show tooltips when users hover over specific words or tags in rich text.\r\n\r\nTo receive mouse events from link texts (e.g. hover callbacks), your RichTextBlock must use the <link id=\"decorator\">ULinkRichTextDecorator</> and the UUserWidget must implement the <link id=\"interface\">ILinkEventReceiver</> interface."
			},
			"Key": "37F1DE5F46643DA392A80A9720D9279C"
		}
	]
}